app/views/items/_item.html.erb

SELECT AVG(`reviews`.`all_rating`) FROM `reviews` WHERE `reviews`.`item_id` = 1
---
<%# 星評価機能raty.js %>
<p> <%=@all_rating %>：<%= item.reviews.average(:all_rating).to_f.round(1) %></p>

SELECT AVG(`reviews`.`rating3`) FROM `reviews` WHERE `reviews`.`item_id` = 10
SELECT `items`.* FROM `items`
---
<%# チャート機能chartkick.js %>
<%= pie_chart [
  # [@all_rating, item.reviews.average(:all_rating).to_f.round(1)],
  [@rating1, item.reviews.average(:rating1).to_f.round(1)],
  [@rating2, item.reviews.average(:rating2).to_f.round(1)],
  [@rating3, item.reviews.average(:rating3).to_f.round(1)],
  [@rating4, item.reviews.average(:rating4).to_f.round(1)],
  ] , label: "#{item.item_name}の評価" , width: "300px", height: "300px" , min: 0, max: 5,
  colors: ["#FF0000", "#FFA500", "#AFDFE4", "#F0FFF0"]