app/controllers/items_controller.rb

  def index
    @items = Item.all
    # Item.order(all_rating: :desc)
    @reviews = Review.all
    @all_rating = "総合評価"
    @rating1 = "甘味評価"
    @rating2 = "酸味評価"
    @rating3 = "水分評価"
    @rating4 = "食べやすさ評価"
    @itemname =  Item.pluck(:item_name)
    gon.itemname = @itemname
    gon.allavg = @reviews.average(:all_rating).to_f.round(1)
    gon.rating1avg = @reviews.average(:rating1).to_f.round(1)
---
SELECT AVG(`reviews`.`all_rating`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT `items`.* FROM `items` WHERE `items`.`item_name` LIKE '%ジューシー%'
SELECT AVG(`reviews`.`rating1`) FROM `reviews` WHERE `reviews`.`item_id` = 1