app/controllers/items_controller.rb

SELECT `items`.`id` FROM `items`
SELECT `items`.`item_name` FROM `items`
---
  def index
    @items = Item.all
      # Item.order(all_rating: :desc)
    @reviews = Review.all
    @all_rating = "総合評価"
    @rating1 = "甘味評価"
    @rating2 = "酸味評価"
    @rating3 = "水分評価"
    @rating4 = "食べやすさ評価"
    @itemname =  Item.pluck(:item_name)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `items`.* FROM `items`
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT AVG(`reviews`.`all_rating`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT AVG(`reviews`.`rating1`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT AVG(`reviews`.`rating2`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT AVG(`reviews`.`rating3`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT AVG(`reviews`.`rating4`) FROM `reviews` WHERE `reviews`.`item_id` = 1
SELECT AVG(`reviews`.`all_rating`) FROM `reviews` LEFT OUTER JOIN `users` ON `users`.`id` = `reviews`.`user_id` WHERE `reviews`.`item_id` = 1
---
  def show
    @item = Item.find(params[:id])
    @review = Review.new
    @reviews = @item.reviews.includes(:user)
    gon.item = @item
    gon.review = @review
    gon.all = @item.reviews.average(:all_rating).to_f.round(1)
    gon.rate1 = @item.reviews.average(:rating1).to_f.round(1)
    gon.rate2 = @item.reviews.average(:rating2).to_f.round(1)
    gon.rate3 = @item.reviews.average(:rating3).to_f.round(1)
    gon.rate4 = @item.reviews.average(:rating4).to_f.round(1)

    @all_rating = "総合評価"
    @rating1 = "甘味評価"
    @rating2 = "酸味評価"
    @rating3 = "水分評価"
    @rating4 = "食べやすさ評価"

    gon.allave = @reviews.average(:all_rating)