app/controllers/likes_controller.rb

INSERT INTO `likes` (`user_id`, `item_id`, `created_at`, `updated_at`) VALUES (1, 1, '2022-05-16 13:14:30.053816', '2022-05-16 13:14:30.053816')
---
  def create
    Like.create(user_id: current_user.id, item_id: params[:id])

DELETE FROM `likes` WHERE `likes`.`id` = 1
SELECT `likes`.* FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`item_id` = 1 LIMIT 1
---
  def destroy
    Like.find_by(user_id: current_user.id, item_id: params[:id]).destroy

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
  def item_params
    @item = Item.find(params[:id])