app/controllers/reviews_controller.rb

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
INSERT INTO `reviews` (`comment`, `all_rating`, `rating1`, `rating2`, `rating3`, `rating4`, `user_id`, `item_id`, `created_at`, `updated_at`) VALUES ('aaa', 1.0, 1.0, 1.0, 1.0, 1.0, 1, 1, '2022-05-20 14:47:02.853896', '2022-05-20 14:47:02.853896')
---
  def create
    @item = Item.find(params[:item_id])
    @review = Review.create(review_params)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1
---
  def edit
    # @review = Review.create(review_params)
    @item = Item.find(params[:item_id])
    @review = Review.find(params[:id])

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
UPDATE `reviews` SET `reviews`.`comment` = '編集！aaa2312s', `reviews`.`updated_at` = '2022-05-15 05:10:51.923194' WHERE `reviews`.`id` = 1
---
  def update
    @item = Item.find(params[:item_id])
    @review = Review.find(params[:id])
    if @review.update(review_params)

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 3 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 3
---
  def destroy
    @review = Review.find(params[:id])
    @review.destroy