app/controllers/users_controller.rb

UPDATE `users` SET `users`.`introduction` = '！！！！！！！！！！', `users`.`updated_at` = '2022-05-20 12:59:52.277702' WHERE `users`.`id` = 1
---
  def update
   if current_user.update(user_params)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `likes`.`item_id` FROM `likes` WHERE `likes`.`user_id` = 1
SELECT `items`.* FROM `items` WHERE `items`.`id` IN (2, 1)
---
  def likes
    @user = User.find(params[:id])
    likes = Like.where(user_id: @user.id).pluck(:item_id)
    @like_items = Item.find(likes)